<a href="https://colab.research.google.com/github/placenciohid/GB705/blob/main/Stats_Using_Python_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas - Example

Pandas is a popular Python library for data manipulation and analysis.  The official documentation can be found [here](https://pandas.pydata.org/docs/user_guide/index.html).

In [35]:
# Load the pandas library.
import pandas as pd
import numpy as np

In [36]:
# Read the CSV file into a pandas dataframe.
url = 'https://bit.ly/homes_data'
df_homes = pd.read_csv(url)

In [37]:
# Check the dimensions of the dataset.
df_homes.shape

(67638, 11)

In [38]:
# List the columns and their data types.
df_homes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67638 entries, 0 to 67637
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            67638 non-null  int64
 1   borough       67638 non-null  int64
 2   neighborhood  67638 non-null  object
 3   block         67638 non-null  int64
 4   lot           67638 non-null  int64
 5   easement      67638 non-null  object
 6   units         67638 non-null  int64
 7   land_sqft     67638 non-null  object
 8   gross_sqft    67638 non-null  object
 9   year_built    67638 non-null  int64
 10  sale_price    67638 non-null  object
dtypes: int64(6), object(5)
memory usage: 5.7+ MB

In [39]:
# Preview the first few records.
df_homes.head()

,id,borough,neighborhood,block,lot,easement,units,land_sqft,gross_sqft,year_built,sale_price
0,0,1,ALPHABET CITY,392,6,,5,1633,6440,1900,6625000
1,1,1,ALPHABET CITY,399,26,,31,4616,18690,1900,-
2,2,1,ALPHABET CITY,399,39,,17,2212,7803,1900,-
3,4,1,ALPHABET CITY,404,55,,6,2369,4615,1900,8000000
4,5,1,ALPHABET CITY,405,16,,20,2581,9730,1900,-

In [40]:
# Sort values in the data frame.
df_homes.sort_values('units', ascending=False)

,id,borough,neighborhood,block,lot,easement,units,land_sqft,gross_sqft,year_built,sale_price
51859,64831,4,JAMAICA,9827,39,,2261,2940,4522,1920,315000
49191,61461,4,GLEN OAKS,8489,1,,1866,4228300,3750565,1972,-
49190,61460,4,GLEN OAKS,8489,1,,1866,4228300,3750565,1972,525000
19331,24035,2,SOUNDVIEW,3600,4,,955,679000,1021752,1977,70936348
5111,6332,1,KIPS BAY,934,1,,902,141836,829024,1975,620000000
...,...,...,...,...,...,...,...,...,...,...,...
18647,23202,2,RIVERDALE,5953,230,,0,0,0,1961,385000
18648,23203,2,RIVERDALE,5953,230,,0,0,0,1961,229000
18649,23204,2,RIVERDALE,5953,230,,0,0,0,1961,255000
18650,23205,2,RIVERDALE,5953,230,,0,0,0,1961,0
2890,3611,1,GREENWICH VILLAGE-CENTRAL,532,20,,0,-,-,1930,937000

In [41]:
# Select a specific set of rows by position.
df_homes.iloc[5:10]

,id,borough,neighborhood,block,lot,easement,units,land_sqft,gross_sqft,year_built,sale_price
5,6,1,ALPHABET CITY,406,32,,8,1750,4226,1920,3192840
6,7,1,ALPHABET CITY,407,18,,46,5163,21007,1900,-
7,9,1,ALPHABET CITY,387,153,,24,4489,18523,1920,16232000
8,10,1,ALPHABET CITY,394,44,,34,4295,21328,1910,-
9,12,1,ALPHABET CITY,373,40,,0,-,-,1920,1

In [42]:
# Select a specific set of rows and columns by position.
df_homes.iloc[5:10, 2:5]

    neighborhood  block  lot
5  ALPHABET CITY    406   32
6  ALPHABET CITY    407   18
7  ALPHABET CITY    387  153
8  ALPHABET CITY    394   44
9  ALPHABET CITY    373   40

In [43]:
# Select a specific set of rows and columns by position.
df_homes.iloc[:, [2,4,6]]

        neighborhood  lot  units
0      ALPHABET CITY    6      5
1      ALPHABET CITY   26     31
2      ALPHABET CITY   39     17
3      ALPHABET CITY   55      6
4      ALPHABET CITY   16     20
...              ...  ...    ...
67633        WOODROW  126      2
67634        WOODROW   41      2
67635        WOODROW   34      2
67636        WOODROW   60      2
67637        WOODROW   28      7

[67638 rows x 3 columns]

In [44]:
# Select rows that meet a certain criteria.
df_homes[df_homes.units > 800]

,id,borough,neighborhood,block,lot,easement,units,land_sqft,gross_sqft,year_built,sale_price
5111,6332,1,KIPS BAY,934,1,,902,141836,829024,1975,620000000
19331,24035,2,SOUNDVIEW,3600,4,,955,679000,1021752,1977,70936348
27725,34521,3,CROWN HEIGHTS,1156,70,,889,24573,49500,1930,0
49190,61460,4,GLEN OAKS,8489,1,,1866,4228300,3750565,1972,525000
49191,61461,4,GLEN OAKS,8489,1,,1866,4228300,3750565,1972,-
51859,64831,4,JAMAICA,9827,39,,2261,2940,4522,1920,315000

In [45]:
# Select a column in the dataset using its name.
df_homes['sale_price']

0         6625000
1             -
2             -
3         8000000
4             -
           ...
67633      648000
67634         -
67635      450000
67636      460000
67637    11693337
Name: sale_price, Length: 67638, dtype: object

In [46]:
# Select a subset of columns using their names.
df_homes[['block', 'lot', 'sale_price']]

       block  lot sale_price
0        392    6    6625000
1        399   26        -
2        399   39        -
3        404   55    8000000
4        405   16        -
...      ...  ...        ...
67633   7317  126     648000
67634   7339   41        -
67635   7349   34     450000
67636   7351   60     460000
67637   7100   28   11693337

[67638 rows x 3 columns]

In [47]:
# Drop unnecessary columns.
df_homes = df_homes.drop(columns=['id', 'easement'])
df_homes.shape

(67638, 9)

In [48]:
# Rename a column.
df_homes = df_homes.rename(columns = {'borough':'district'})
df_homes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67638 entries, 0 to 67637
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   district      67638 non-null  int64
 1   neighborhood  67638 non-null  object
 2   block         67638 non-null  int64
 3   lot           67638 non-null  int64
 4   units         67638 non-null  int64
 5   land_sqft     67638 non-null  object
 6   gross_sqft    67638 non-null  object
 7   year_built    67638 non-null  int64
 8   sale_price    67638 non-null  object
dtypes: int64(5), object(4)
memory usage: 4.6+ MB

In [49]:
# Convert selected columns into the appropriate data types.
df_homes['land_sqft'] = pd.to_numeric(df_homes['land_sqft'], errors='coerce')
df_homes['gross_sqft'] = pd.to_numeric(df_homes['gross_sqft'], errors='coerce')
df_homes['sale_price'] = pd.to_numeric(df_homes['sale_price'], errors='coerce')
df_homes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67638 entries, 0 to 67637
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   district      67638 non-null  int64
 1   neighborhood  67638 non-null  object
 2   block         67638 non-null  int64
 3   lot           67638 non-null  int64
 4   units         67638 non-null  int64
 5   land_sqft     46553 non-null  float64
 6   gross_sqft    45472 non-null  float64
 7   year_built    67638 non-null  int64
 8   sale_price    55936 non-null  float64
dtypes: float64(3), int64(5), object(1)
memory usage: 4.6+ MB

In [50]:
# Determine if there are any null values.
df_homes.isnull().sum()

district            0
neighborhood        0
block               0
lot                 0
units               0
land_sqft       21085
gross_sqft      22166
year_built          0
sale_price      11702
dtype: int64

In [51]:
# Replace NULL values.
df_homes_filled = df_homes.fillna(500)
df_homes_filled[df_homes_filled.sale_price == 500].head()

,district,neighborhood,block,lot,units,land_sqft,gross_sqft,year_built,sale_price
1,1,ALPHABET CITY,399,26,31,4616.0,18690.0,1900,500.0
2,1,ALPHABET CITY,399,39,17,2212.0,7803.0,1900,500.0
4,1,ALPHABET CITY,405,16,20,2581.0,9730.0,1900,500.0
6,1,ALPHABET CITY,407,18,46,5163.0,21007.0,1900,500.0
8,1,ALPHABET CITY,394,44,34,4295.0,21328.0,1910,500.0

In [52]:
# Drop the records with null values. (Be cautious.)
# df_homes_null = df_homes.dropna()
# df_homes_null.isnull().sum()

df_homes = df_homes.dropna()
df_homes.isnull().sum()

district        0
neighborhood    0
block           0
lot             0
units           0
land_sqft       0
gross_sqft      0
year_built      0
sale_price      0
dtype: int64

In [53]:
# Check to see if there are any duplicate records.
sum(df_homes.duplicated(df_homes.columns))

711

In [54]:
# Delete the duplicates.
df_homes = df_homes.drop_duplicates(df_homes.columns, keep='last')
sum(df_homes.duplicated(df_homes.columns))

0

In [55]:
# Generate descriptive stats for the numeric columns.
df_homes.describe()

,district,block,lot,units,land_sqft,gross_sqft,year_built,sale_price
count,37832.000000,37832.00000,37832.000000,37832.000000,3.783200e+04,3.783200e+04,37832.000000,3.783200e+04
mean,3.255472,4994.96043,234.393979,2.870824,3.388155e+03,3.705101e+03,1828.269137,1.227169e+06
std,0.905603,3438.21877,496.382130,21.815485,3.412779e+04,3.204094e+04,463.226348,1.499390e+07
min,1.000000,1.00000,1.000000,0.000000,0.000000e+00,0.000000e+00,0.000000,0.000000e+00
25%,3.000000,2217.75000,21.000000,1.000000,1.440000e+03,8.640000e+02,1920.000000,1.174562e+05
50%,3.000000,4666.00000,45.000000,1.000000,2.146000e+03,1.624000e+03,1931.000000,4.900000e+05
75%,4.000000,6986.25000,94.000000,2.000000,3.069000e+03,2.516000e+03,1960.000000,8.400000e+05
max,5.000000,16319.00000,9009.000000,2261.000000,4.228300e+06,3.750565e+06,2017.000000,2.210000e+09

In [56]:
# Remove homes with 0's in the sale price.
df_homes = df_homes[df_homes['sale_price'] > 0]
df_homes.shape

(30083, 9)

In [57]:
# Remove homes that have 0 as their "YEAR BUILT".
df_homes = df_homes[df_homes['year_built'] > 0]
df_homes.shape

(28629, 9)

In [58]:
# Create a column called "BUILDING AGE," which is more useful than "YEAR BUILT"
df_homes['building_age'] = 2022 - df_homes['year_built']
df_homes.head()

,district,neighborhood,block,lot,units,land_sqft,gross_sqft,year_built,sale_price,building_age
0,1,ALPHABET CITY,392,6,5,1633.0,6440.0,1900,6625000.0,122
3,1,ALPHABET CITY,404,55,6,2369.0,4615.0,1900,8000000.0,122
5,1,ALPHABET CITY,406,32,8,1750.0,4226.0,1920,3192840.0,102
7,1,ALPHABET CITY,387,153,24,4489.0,18523.0,1920,16232000.0,102
17,1,ALPHABET CITY,376,14,24,4131.0,16776.0,1928,11900000.0,94

In [59]:
# Remove properties that have SQFT greater than 10,000.
df_homes = df_homes[df_homes['gross_sqft'] < 10000]
df_homes = df_homes[df_homes['land_sqft'] < 10000]
df_homes.shape

(27465, 10)

In [60]:
# Change the boroughs from a number to their actual name.
df_homes['district'] = df_homes['district'].replace([1, 2, 3, 4, 5],
                                                    ['Manhattan',
                                                     'Bronx',
                                                     'Brooklyn',
                                                     'Queens',
                                                     'Staten Island'])
df_homes['district'].head()

0      Manhattan
3      Manhattan
5      Manhattan
138    Manhattan
139    Manhattan
Name: district, dtype: object

In [61]:
# Count frequencies in a categorical column.
# df_homes['neighborhood'].value_counts()
df_homes['district'].value_counts()

Brooklyn         11009
Queens            8596
Staten Island     3804
Bronx             3580
Manhattan          476
Name: district, dtype: int64

In [62]:
# Convert a categorical variable into dummy variables.
pd.get_dummies(df_homes['district'], columns=['district'], prefix='d')

       d_Bronx  d_Brooklyn  d_Manhattan  d_Queens  d_Staten Island
0            0           0            1         0                0
3            0           0            1         0                0
5            0           0            1         0                0
138          0           0            1         0                0
139          0           0            1         0                0
...        ...         ...          ...       ...              ...
67628        0           0            0         0                1
67629        0           0            0         0                1
67632        0           0            0         0                1
67635        0           0            0         0                1
67636        0           0            0         0                1

[27465 rows x 5 columns]

In [63]:
# Randomly select two samples of 10 rows each.
sample1 = df_homes.sample(n=10)
sample2 = df_homes.sample(n=10)

# Append rows.
combined_sample = pd.concat([sample1, sample2])
combined_sample.shape

(20, 10)

In [69]:
# Explore data using pivot tables.
# pd.pivot_table(df_homes, index=['district'], values=['sale_price'])
# pd.pivot_table(df_homes, index=['district'], values=['sale_price'], aggfunc=[np.sum])
# pd.pivot_table(df_homes, index=['district'], values=['sale_price'], aggfunc=[np.sum, np.mean])
pd.pivot_table(df_homes, index=['district', 'neighborhood'], values=['sale_price'], aggfunc=[np.sum, np.mean])
# df_pivot = pd.pivot_table(df_homes, index=['district', 'neighborhood'], values=['sale_price'], aggfunc=[np.sum, np.mean])
# df_pivot

                                            sum          mean
                                     sale_price    sale_price
district      neighborhood
Bronx         BATHGATE               19684293.0  5.964937e+05
              BAYCHESTER            100729034.0  4.078099e+05
              BEDFORD PARK/NORWOOD   49696670.0  4.437203e+05
              BELMONT                35382557.0  1.220088e+06
              BRONXDALE              74450163.0  3.960115e+05
...                                         ...           ...
Staten Island TRAVIS                 17363215.0  3.946185e+05
              WEST NEW BRIGHTON      70476392.0  4.220143e+05
              WESTERLEIGH            75755045.0  5.372698e+05
              WILLOWBROOK            56235783.0  5.919556e+05
              WOODROW                33461885.0  5.228420e+05

[243 rows x 2 columns]

In [65]:
# Export the pivot table to a CSV file.
from google.colab import files
df_pivot.to_csv('prices-by-borough.csv') 
files.download('prices-by-borough.csv')

ModuleNotFoundError: No module named 'google.colab'